examples/pressuretest/GPU_gas/hll_kurganov/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (0 0 0);
    }
    wall
    {
        type noSlip;
    }
    wedgeBack { type wedge; }
    wedgeFront { type wedge; }
}
